nicohs67/deepsdr-101-open-firmware/User/gd32_i2s.c
#include "gd32_i2s.h"
#include "gd32f4xx.h"
#include "debug_uart.h"
#include "sdr_rx.h" /* SDR_RX_BLOCK_SAMPLES - see STREAM_FRAMES_PER_HALF's
                      * comment below for why this MUST be the single
                      * source of truth here, not a hand-copied number. */
#include "aic3204.h" /* only for the shared AIC3204_TEST_LOOPBACK diagnostic
                      * flag - temporary coupling, see the note below where
                      * it's used. */

static void tone_buf_fill_1khz(void);
static float sinf_approx(float x);

/*
 * Diagnostic utility: toggles the five I2S pins as plain GPIO output
 * (peripheral untouched). Useful to isolate a "no signal" symptom
 * between a peripheral/clock configuration issue and a physical
 * wiring issue - if even a plain GPIO toggle doesn't show up on a
 * scope, the problem is upstream of the I2S peripheral entirely.
 */
void gd32_i2s_pins_gpio_toggle_test(uint32_t cycles)
{
    uint32_t i;

    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);

    {
        uint32_t pinsB = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
        gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, pinsB);
        gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, pinsB);
        gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
        gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
    }

    debug_print("gd32_i2s: GPIO toggle test on PB12/13/14/15 and PC6 "
                "(no I2S) - probe now\n");

    for (i = 0; i < cycles; i++) {
        gpio_bit_set(GPIOB, GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15);
        gpio_bit_set(GPIOC, GPIO_PIN_6);
        {
            volatile uint32_t d;
            for (d = 0; d < 500000U; d++) {
                __NOP();
            }
        }
        gpio_bit_reset(GPIOB, GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15);
        gpio_bit_reset(GPIOC, GPIO_PIN_6);
        {
            volatile uint32_t d;
            for (d = 0; d < 500000U; d++) {
                __NOP();
            }
        }
    }

    debug_print("gd32_i2s: GPIO toggle test done\n");
}

void gd32_i2s_init_slave_192k(void)
{
    gd32_i2s_init_slave(AIC3204_RATE_96K);
}

/*
 * *** 05/08/2026, generalized from gd32_i2s_init_slave_192k() for the
 * "full reinit instead of live resync" rewrite ***
 *
 * HISTORY: every earlier attempt at a LIVE rate switch tried to keep
 * SPI1/I2S1_ADD's existing configuration and just nudge them back into
 * sync - a plain disable/re-enable of I2SEN (sdr_rx_resync_spi()'s and
 * gd32_i2s_stream_start()'s old approach), or reordering that against
 * the codec's own reset/reconfigure. Real hardware logs kept finding
 * the SAME result no matter which of those was tried: FERR starts
 * firing after a live switch and NEVER clears again, even switching
 * back to a rate that was clean moments earlier - while running a
 * given rate from a genuine COLD BOOT (this same function, called
 * once from main.c before the main loop starts) is rock solid, FERR
 * always 0, indefinitely.
 *
 * That gap - cold boot always clean, live switch never fully clean -
 * means something LIVE switching left touched (PLLI2S's own state,
 * SPI1/I2S1_ADD's internal shift/frame counters, or some combination)
 * that a bare I2SEN toggle doesn't reset, even though every DIRECTLY
 * READABLE register looks identical either way. Rather than keep
 * chasing which specific bit that is, this function is now called on
 * EVERY rate change (cold boot AND live), doing the FULL teardown/
 * rebuild cold boot always did: spi_i2s_deinit(SPI1) (which also
 * clears I2S1_ADD's extension state, since it's the same peripheral
 * instance), a full PLLI2S off/reconfigure/on/wait-for-lock, and a
 * full i2s_init()/i2s_full_duplex_mode_config() + GPIO AF replay - not
 * just re-enabling what was already configured. Slower (a few hundred
 * microseconds of extra I2C-scale bring-up, irrelevant next to the
 * WFM_SETTLE_MUTE_BLOCKS-sized silence a mode switch already has), but
 * this is the ONLY sequence that's ever measured clean on real
 * hardware - see main.c's apply_demod_mode() for where this now sits
 * in the full switch sequence.
 */
void gd32_i2s_init_slave(aic3204_rate_t rate)
{
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_SPI1);

    /*
     * Clean reset of SPI1/I2S1/I2S1_ADD in case any state was
     * inherited from the bootloader or a previous configuration -
     * this board is chained from a bootloader rather than power-cycled
     * on every flash, so residual peripheral state is possible. On a
     * LIVE switch (not just cold boot), this is also what tears down
     * whatever residual internal state the previous rate's I2SEN left
     * behind - see this function's own header comment.
     */
    spi_i2s_deinit(SPI1);

    /*
     * PLLI2S must be configured explicitly (not left at its reset/
     * inherited value) to get a known, reproducible i2sclock.
     *
     * IMPORTANT: the PSC field used here (via rcu_plli2s_config's M
     * divider) is the SAME field as the main system PLL's PSC in
     * system_gd32f4xx.c. If that PSC value ever changes, N/R here must
     * be recalculated together with it to keep the same i2sclock -
     * they are not independent.
     *
     * Current values (PSC=8 in system_gd32f4xx.c, N=400/R=4 here):
     * i2sclock = (12.288MHz/8) * 400/4 = 49.152MHz exactly. This does
     * NOT depend on `rate` - i2sclock feeds I2S_AUDIOSAMPLE_48K/192K's
     * OWN internal divider math below, so the same PLLI2S setting
     * covers both rates.
     */
    rcu_osci_off(RCU_PLLI2S_CK);
    if (rcu_plli2s_config(400U, 4U) != SUCCESS) {
        debug_print("gd32_i2s: rcu_plli2s_config(400,4) FAILED\n");
    }
    rcu_osci_on(RCU_PLLI2S_CK);
    if (rcu_osci_stab_wait(RCU_PLLI2S_CK) != SUCCESS) {
        debug_print("gd32_i2s: *** PLLI2S DID NOT LOCK (stab_wait ERROR) - no i2sclock ***\n");
    }

