nicohs67/deepsdr-101-open-firmware/User/gd32_i2s.c
    /*
     * BLOCK ROLES SWAPPED (28/07/2026): a real I2C capture combined
     * with disassembly of the original firmware's own I2S setup code
     * shows the struct tied to the SPI1_BASE literal being initialized
     * with Mode=0x100 - which matches I2S_MODE_SLAVERX exactly (this
     * project's own I2SCTL_I2SOPMOD(1) encoding). That means the
     * ORIGINAL firmware configures the MAIN SPI1/I2S1 block as the
     * RECEIVE side (ADC capture, on PB15/SD) and the I2S1_ADD
     * extension as the TRANSMIT side (DAC feed, on PB14/SDext) - the
     * OPPOSITE of what this driver assumed for a very long time (main
     * block = TX, extension = RX). The GD32F4xx User Manual's DMA0
     * request mapping table confirms both halves of this swap exist
     * as distinct, real options on the exact same DMA channels we
     * were already using (DMA0/CH3: SPI1_RX at SUBPERI0 vs
     * I2S1_ADD_RX at SUBPERI3; DMA0/CH4: I2S1_ADD_TX at SUBPERI2 vs
     * SPI1_TX at SUBPERI0) - meaning this whole time, ADC samples were
     * very plausibly being captured from the wrong subperipheral of
     * the right DMA channel, which would explain why no amount of
     * clock, DMA priority, or master/slave fixing on the OTHER half
     * ever changed anything: the real ADC data path was never the one
     * being read from at all.
     *
     * SLAVE mode (still applies, unrelated to this swap): a real I2C
     * capture of the original firmware's AIC3204 configuration shows
     * register 0x1B=0x0C, which (confirmed against a real TI forum
     * example using this exact byte, plus TI's own SLAA404C app note
     * describing bits D3:D2 of this register as the BCLK/WCLK
     * direction control) sets BOTH BCLK and WCLK as OUTPUTS on the
     * codec - i.e. the codec is the I2S master in this design. The
     * GD32 must be the SLAVE to match (confirmed clean, single-source
     * BCLK/WCLK on a real oscilloscope once this was corrected).
     */
    i2s_init(SPI1, I2S_MODE_SLAVERX, I2S_STD_PHILLIPS, I2S_CKPL_LOW);

    /*
     * MCLK: TIMER2_CH0/PC6, started once at cold boot by
     * gd32_i2s_mclk_timer_start() (main.c) and never touched again -
     * fixed 1.536MHz regardless of `rate` (see aic3204.c's header
     * comment: the codec's own PLL is sourced from BCLK, not MCLK, so
     * MCLK doesn't need to change with the audio sample rate).
     *
     * i2s_psc_config's audiosample argument IS now rate-dependent -
     * this is the one piece of this function that actually differs
     * between the two calls (48kHz cold boot vs either rate on a live
     * switch). Whether SPI_I2SPSC does anything in SLAVE mode is still
     * genuinely unclear from the source alone (see the historical note
     * this replaced - real 192kHz captures worked fine even with a
     * stale 48kHz value here) - passed correctly anyway, on the "make
     * the code say what's actually true" principle.
     */
    i2s_psc_config(SPI1,
                    (rate == AIC3204_RATE_192K) ? I2S_AUDIOSAMPLE_192K : I2S_AUDIOSAMPLE_48K,
                    I2S_FRAMEFORMAT_DT16B_CH16B, I2S_MCKOUT_DISABLE);

    /* I2S1_ADD extension block: passed the SAME mode as the main block
     * (I2S_MODE_SLAVERX) - the library internally derives the OPPOSITE
     * role for the extension block, I2S_MODE_SLAVETX in this case
     * (shares the clock with the master - now the CODEC, not the GD32
     * - transmit-only). This is now the path that feeds the AIC3204's
     * DAC (silence/test tone), captured... err, driven, by DMA in
     * gd32_i2s_dma_start_silence()/gd32_i2s_dma_start_test_tone()
     * below, via PB14 (SDext). The MAIN block above is now the one
     * capturing ADC samples on PB15 (SD), via DMA in sdr_rx.c. */
    i2s_full_duplex_mode_config(I2S1_ADD, I2S_MODE_SLAVERX, I2S_STD_PHILLIPS,
                                 I2S_CKPL_LOW, I2S_FRAMEFORMAT_DT16B_CH16B);

    /*
     * GPIO/AF configuration must happen BEFORE i2s_enable(). If the
     * pins are still plain GPIO (e.g. left over from
     * gd32_i2s_pins_gpio_toggle_test) when the peripheral starts, the
     * internal clock generator can run with no signal reaching the
     * physical pins at all. Re-doing this on every call (not just cold
     * boot) is cheap and removes any doubt about GPIO state surviving
     * a live switch correctly.
     *
     * WS, CK, SD(TX): AF5 on PB12/13/14/15 (SPI1/I2S1 block). PC6
     * (MCLK) is intentionally NOT configured - see the MCKOUT note
     * above.
     */
    {
        uint32_t pins = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_15;
        gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, pins);
        gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, pins);
        gpio_af_set(GPIOB, GPIO_AF_5, pins);
    }
    {
        /*
         * AF6 for I2S1_ADD_SD (RX data in), confirmed against the
         * GD32F450xx datasheet's Port B alternate function table:
         * PB14 lists SPI1_MISO on AF5 and I2S1_ADD_SD on AF6.
         */
        gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_14);
        gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_14);
        gpio_af_set(GPIOB, GPIO_AF_6, GPIO_PIN_14);
    }

    i2s_enable(SPI1);
    i2s_enable(I2S1_ADD);

    debug_print_hex32("gd32_i2s: SPI_I2SCTL after i2s_enable (SPI1, bit10=I2SEN should be 1)",
                       SPI_I2SCTL(SPI1));
    debug_print_hex32("gd32_i2s: RCU_CFG0 raw (I2SSEL toggle bit is bit 23)", RCU_CFG0);

    debug_print_dec("gd32_i2s: full slave reinit done for rate (0=48K,1=192K)",
                     (uint32_t)rate);

#if AIC3204_TEST_LOOPBACK
    /* Loopback test needs a real, recognizable TX pattern - silence
     * looped back is still silence, not a useful test. */
    gd32_i2s_dma_start_test_tone();
#else
    gd32_i2s_dma_start_silence();
#endif
}

/*
 * 1kHz sine tone table, stereo (L=R), 16-bit, at the real confirmed
 * frame rate (192kHz). 192000/1000 = 192 samples per cycle exactly, so
 * the table is short and there is no frequency rounding error.
 * Amplitude is moderate (not full-scale) to be safe on a speaker or
 * headphones during bring-up testing.
 */
#define TONE_SAMPLES_PER_CYCLE   192U
static int16_t s_tone_buf[TONE_SAMPLES_PER_CYCLE * 2U]; /* *2: interleaved L/R */

static void tone_buf_fill_1khz(void)
{
    uint32_t n;
    for (n = 0; n < TONE_SAMPLES_PER_CYCLE; n++) {
        /* Amplitude ~+-8000 (25% of 16-bit full scale). Computed once
         * at init time (not in a hot path), so a compile-time LUT
         * isn't needed - a runtime float fill is fine here. */
        float angle = (2.0f * 3.14159265358979f * (float)n) / (float)TONE_SAMPLES_PER_CYCLE;
        int16_t sample = (int16_t)(8000.0f * sinf_approx(angle));
        s_tone_buf[2U * n]      = sample; /* left */
        s_tone_buf[2U * n + 1U] = sample; /* right (same tone on both) */
    }
}

