nicohs67/deepsdr-101-open-firmware/User/gd32_i2s.c
/* Sine approximation with no libm dependency (this project links with
 * nano.specs and no -lm): Bhaskara I approximation, typical error
 * <0.2% across the full range - more than enough for an audible test
 * tone. */
static float sinf_approx(float x)
{
    float pi = 3.14159265358979f;
    float x2;
    int negate = 0;
    while (x > pi) { x -= 2.0f * pi; }
    while (x < -pi) { x += 2.0f * pi; }
    if (x < 0.0f) { x = -x; negate = 1; }
    x2 = (16.0f * x * (pi - x)) / (5.0f * pi * pi - 4.0f * x * (pi - x));
    return negate ? -x2 : x2;
}

/*
 * IMPORTANT: this MCU's I2S master clock generator only produces
 * continuous BCLK/WS while TX data keeps flowing - it is NOT
 * free-running (see the manual feed loop in
 * gd32_i2s_init_slave_192k()). Since I2S1_ADD (RX) is wired as a
 * SLAVE sharing the SAME BCLK/WS lines as the TX master block, RX
 * capture silently stops the moment BCLK/WS stop - even though RX
 * itself has nothing to do with the TX audio content. A continuous TX
 * feed is therefore required to keep the whole bus alive, not just to
 * produce audio output. Feeding silence (all zeros) instead of the
 * audible test tone keeps BCLK/WS running without an audible tone.
 */
static const int16_t s_silence_buf[16] = {0}; /* small, doesn't need to match any tone period */

/*
 * MCLK generation via TIMER2_CH0 on PC6, AF2 - confirmed against the
 * GD32F450xx datasheet's Port C alternate function table (Table 2-8),
 * cross-checked against the already-empirically-confirmed AF5=I2S1_MCK
 * on the same row.
 *
 * Targets exactly 1.536MHz, matching the real board's confirmed MCLK
 * frequency. With this project's clock config (PSC=8/PLLN=260/PLLP=2
 * in system_gd32f4xx.c -> SYSCLK=199.68MHz, APB1_PSC=4 -> PCLK1=
 * 49.92MHz -> TIMER2CLK=2xPCLK1=99.84MHz when APB1 prescaler != 1,
 * standard on this family): 99.84MHz / 65 = 1.536MHz exactly. PSC=0,
 * period=64 (65 total counts) gives that division with no remainder -
 * a clean, exact match, not a rounded approximation.
 *
 * Duty cycle is close to but not exactly 50% (32/65 ~= 49.2%) since 65
 * is odd and can't split evenly - a minor asymmetry that should not
 * matter for a clock reference input.
 */
void gd32_i2s_mclk_timer_start(void)
{
    timer_parameter_struct timer_init_struct;
    timer_oc_parameter_struct oc_init_struct;

    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_TIMER2);

    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
    gpio_af_set(GPIOC, GPIO_AF_2, GPIO_PIN_6);

    timer_deinit(TIMER2);

    timer_struct_para_init(&timer_init_struct);
    timer_init_struct.prescaler         = 0U;
    timer_init_struct.alignedmode       = TIMER_COUNTER_EDGE;
    timer_init_struct.counterdirection  = TIMER_COUNTER_UP;
    timer_init_struct.clockdivision     = TIMER_CKDIV_DIV1;
    timer_init_struct.period            = 64U; /* 65 counts: 99.84MHz/65 = 1.536MHz exact */
    timer_init_struct.repetitioncounter = 0U;
    gd32_timer_init(TIMER2, &timer_init_struct);

    timer_channel_output_struct_para_init(&oc_init_struct);
    oc_init_struct.outputstate  = TIMER_CCX_ENABLE;
    oc_init_struct.ocpolarity   = TIMER_OC_POLARITY_HIGH;
    timer_channel_output_config(TIMER2, TIMER_CH_0, &oc_init_struct);

    timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_0, 32U); /* ~49.2% duty */
    timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_PWM0);

    timer_auto_reload_shadow_enable(TIMER2);
    timer_enable(TIMER2);

    debug_print("gd32_i2s: MCLK started via TIMER2_CH0/PC6 (AF2), target 1.536MHz "
                "exact - verify with a scope before relying on it\n");
}


void gd32_i2s_dma_start_silence(void)
{
    dma_single_data_parameter_struct dma_init_struct;

    rcu_periph_clock_enable(RCU_DMA0);

    /* DMA0, Channel 4, PERIEN=010 (SUBPERI2) for I2S1_ADD_TX - now the
     * TX side after the block-role swap (see gd32_i2s_init_slave_192k)
     * - confirmed against the GD32F4xx User Manual's DMA request
     * mapping table (Table 10-2, "Peripheral requests to DMA0"). Same
     * channel as gd32_i2s_dma_start_test_tone(), just a silent source
     * buffer. */
    dma_deinit(DMA0, DMA_CH4);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.periph_addr         = (uint32_t)&SPI_DATA(I2S1_ADD);
    dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory0_addr        = (uint32_t)s_silence_buf;
    dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
    dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_ENABLE;
    dma_init_struct.direction           = DMA_MEMORY_TO_PERIPH;
    dma_init_struct.number              = 16U;
    /*
     * *** 05/08/2026 fix ***: was DMA_PRIORITY_HIGH, one level below
     * sdr_rx.c's RX channel (DMA0/CH3, DMA_PRIORITY_ULTRA_HIGH - see
     * its own comment for why RX was bumped there). Both channels
     * share DMA0, so on any request collision RX always won and TX
     * (this channel, feeding I2S1_ADD/the DAC) went unserved that
     * cycle. Invisible at 48kHz - request rates low enough that
     * simultaneous collisions were rare - but at WFM's 192kHz (4x the
     * request rate on BOTH channels), collisions became frequent
     * enough to starve I2S1_ADD's data register right before a BCLK
     * edge, which is exactly what SPI_STAT_FERR flags: real hardware
     * logs showed it set on essentially every sdr_tick check for the
     * entire duration of a WFM session, and never once at 48kHz -
     * matching the project owner's "ruido de fondo" report (a starved
     * TX register underneath otherwise-correct audio, not a gain/
     * volume issue - the RX side, which always won the arbitration,
     * stayed clean the whole time, which is also why the spectrum
     * display and rx_lock's corruption check never showed anything
     * wrong). Bumped to match RX's ULTRA_HIGH rather than lowering RX
     * - RX was raised in the first place to fight a real, persistent
     * RXORERR (see sdr_rx.c's own comment), and undoing that risks
     * bringing that back. Matching priorities won't guarantee TX wins
     * a tie, but stops it from strictly losing every single time
     * (unclear from the docs alone how the underlying arbiter breaks a
     * same-priority tie between CH3/CH4, so validate this reduces or
     * clears the FERR reports on real hardware, don't assume from the
     * datasheet). Applied identically here (silence keeper) and in
     * gd32_i2s_dma_start_test_tone() and stream_arm_dma() below, since
     * whichever last armed DMA0/CH4 needs the same priority - not
     * something that should vary by which TX source is active.
     */
    dma_init_struct.priority            = DMA_PRIORITY_ULTRA_HIGH;
    dma_single_data_mode_init(DMA0, DMA_CH4, &dma_init_struct);

