nicohs67/deepsdr-101-open-firmware/User/gd32_i2s.c
    dma_channel_subperipheral_select(DMA0, DMA_CH4, DMA_SUBPERI2);

    dma_circulation_enable(DMA0, DMA_CH4);
    dma_channel_enable(DMA0, DMA_CH4);

    spi_dma_enable(I2S1_ADD, SPI_DMA_TRANSMIT);
}

/*
 * *** BUG FOUND AND FIXED 04/08/2026 - THIS is almost certainly what
 * the project owner heard as a high-pitched hiss, a "repeating
 * pattern", and general slowdown right after the 48kHz migration ***
 *
 * This was previously a HAND-COPIED literal `512U`, with a comment
 * literally saying "MUST equal SDR_RX_BLOCK_SAMPLES" - a manually
 * maintained invariant, not an enforced one. When SDR_RX_BLOCK_SAMPLES
 * dropped from 512 to 128 (see sdr_rx.h's own comment) for the 48kHz
 * move, THIS constant was never touched, because nothing forced it to
 * be. The result: gd32_i2s_stream_write_half() below copies
 * STREAM_WORDS_PER_HALF (1024 int16 words, derived from the STALE
 * 512) from whatever buffer the caller passes it - but demod_am.c's
 * s_audio_out[] is only SDR_RX_BLOCK_SAMPLES*2 = 256 words long now.
 * Every single call read 768 words PAST THE END of s_audio_out[] -
 * whatever static memory happens to sit after it in the linker layout
 * - and played that garbage out the DAC alongside the real 256 words
 * of audio. That's a textbook explanation for all three symptoms:
 * hiss/noise (reading unrelated memory as PCM), a "repeating pattern"
 * (that adjacent memory's own contents are fairly static from block
 * to block), and it plausibly contributing to the reported slowdown
 * too (see gd32_i2s_stream_write_half()'s DMA-position math below,
 * which was also computing on the wrong buffer geometry).
 *
 * FIX: reference SDR_RX_BLOCK_SAMPLES (sdr_rx.h) directly instead of
 * hand-copying it - this file now has ONE source of truth for the
 * frame count, and it can never silently drift out of sync with the
 * actual RX block size again, the way the plain literal just did.
 *
 * --- TX audio stream (demodulated audio -> DAC) ---------------------
 *
 * A 2-half ping-pong buffer played by the same circular DMA channel
 * (DMA0/CH4) that the silence/test-tone paths use. Each half holds
 * exactly one RX block's worth of stereo frames: since RX and TX are
 * clocked by the SAME codec-driven BCLK/WS at the same rate, every
 * completed RX half corresponds to exactly one TX half consumed -
 * the two sides cannot drift, only the phase offset at startup
 * varies, and gd32_i2s_stream_write_half() re-derives the safe half
 * from the live DMA position on every call, so it self-corrects.
 */
#define STREAM_FRAMES_PER_HALF_MAX SDR_RX_BLOCK_SAMPLES_MAX /* 512 - see
                                    * sdr_rx.h's own comment on SDR_RX_BLOCK_SAMPLES_MAX.
                                    * Buffer below is ALWAYS this size; the ACTIVE half
                                    * size (s_stream_frames_per_half) tracks whichever
                                    * mode is running - see gd32_i2s_stream_reconfigure(). */
#define STREAM_WORDS_PER_HALF_MAX  (STREAM_FRAMES_PER_HALF_MAX * 2U) /* stereo */
#define STREAM_TOTAL_WORDS_MAX     (STREAM_WORDS_PER_HALF_MAX * 2U)

static int16_t s_stream_buf[STREAM_TOTAL_WORDS_MAX]; /* zero-initialized: silence */

/* Active stream geometry - defaults to SDR_RX_BLOCK_SAMPLES (48kHz);
 * gd32_i2s_stream_reconfigure() (05/08/2026, added for WFM's 192kHz
 * reactivation) updates these when switching rates, following the
 * exact same stop/reconfigure/start split sdr_rx.h/.c already
 * established - see its own comments for why the order matters. */
static uint32_t s_stream_frames_per_half = SDR_RX_BLOCK_SAMPLES;
static uint32_t s_stream_words_per_half  = SDR_RX_BLOCK_SAMPLES * 2U;
static uint32_t s_stream_total_words     = SDR_RX_BLOCK_SAMPLES * 4U;

/* See gd32_i2s_stream_write_half()'s own comment - counts real FERR
 * occurrences on I2S1_ADD, cheaply, once per TX block. */
static volatile uint32_t s_tx_ferr_count = 0U;

/* Shared DMA-arming step - used by both gd32_i2s_dma_start_stream()
 * and gd32_i2s_stream_start() (the re-arm half of reconfigure - see
 * sdr_rx_start()'s equivalent for the reasoning on why this is
 * split out). Silences the WHOLE buffer first, not just the active
 * portion - harmless and simpler than tracking which bytes are
 * "stale" from a previous, differently-sized configuration. */
static void stream_arm_dma(void)
{
    dma_single_data_parameter_struct dma_init_struct;
    uint32_t w;

    for (w = 0; w < STREAM_TOTAL_WORDS_MAX; w++) {
        s_stream_buf[w] = 0;
    }

    rcu_periph_clock_enable(RCU_DMA0);

    dma_channel_disable(DMA0, DMA_CH4);
    while ((DMA_CHCTL(DMA0, DMA_CH4) & DMA_CHXCTL_CHEN) != 0U) {
        /* a disable request can take a few cycles to complete */
    }
    dma_deinit(DMA0, DMA_CH4);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.periph_addr         = (uint32_t)&SPI_DATA(I2S1_ADD);
    dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory0_addr        = (uint32_t)s_stream_buf;
    dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
    dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_ENABLE;
    dma_init_struct.direction           = DMA_MEMORY_TO_PERIPH;
    dma_init_struct.number              = s_stream_total_words;
    /* *** 05/08/2026 fix *** - was DMA_PRIORITY_HIGH, strictly below
     * sdr_rx.c's RX channel (DMA0/CH3, ULTRA_HIGH). THIS is the
     * instance that actually matters for the WFM "ruido de fondo"
     * report - stream_arm_dma() is what's live during real audio
     * playback (the silence-keeper/test-tone instances only run
     * before/outside a real stream). See gd32_i2s_dma_start_silence()'s
     * comment for the full reasoning. */
    dma_init_struct.priority            = DMA_PRIORITY_ULTRA_HIGH;
    dma_single_data_mode_init(DMA0, DMA_CH4, &dma_init_struct);

    dma_channel_subperipheral_select(DMA0, DMA_CH4, DMA_SUBPERI2);
    dma_circulation_enable(DMA0, DMA_CH4);
    dma_channel_enable(DMA0, DMA_CH4);
    spi_dma_enable(I2S1_ADD, SPI_DMA_TRANSMIT);
}

void gd32_i2s_dma_start_stream(void)
{
    gd32_i2s_stream_arm(SDR_RX_BLOCK_SAMPLES);
}

