nicohs67/deepsdr-101-open-firmware/User/gd32_i2s.c
/*
 * *** 05/08/2026, added for the "full reinit instead of live resync"
 * rewrite *** - the real bring-up logic, parametrized by frame count
 * so cold boot (gd32_i2s_dma_start_stream(), unchanged call site in
 * main.c) and every live rate switch (main.c's apply_demod_mode(),
 * called directly with the new rate's frame count) share ONE path,
 * the same way sdr_rx_bringup() unified sdr_rx.c's side. No disable/
 * re-enable of I2S1_ADD here anymore - gd32_i2s_init_slave(rate) (see
 * this file's own header comment) already did a FULL teardown/rebuild
 * of I2S1_ADD immediately before this runs on every path now, cold
 * boot or live, so I2S1_ADD is already freshly enabled and there's
 * nothing stale left to resync.
 */
void gd32_i2s_stream_arm(uint32_t frames_per_half)
{
    s_stream_frames_per_half = frames_per_half;
    s_stream_words_per_half  = frames_per_half * 2U;
    s_stream_total_words     = frames_per_half * 4U;

    stream_arm_dma();

    debug_print_dec("gd32_i2s: TX stream DMA armed, stereo frames per half (starts silent)",
                     s_stream_frames_per_half);
}

/*
 * Cleanly stops the TX stream DMA channel - call before reconfiguring
 * the codec's own clock registers for a rate change, mirroring
 * sdr_rx_stop()'s own comment on why (see main.c's mode-switch
 * sequence for the full ordering across both channels).
 */
void gd32_i2s_stream_stop(void)
{
    dma_channel_disable(DMA0, DMA_CH4);
    while ((DMA_CHCTL(DMA0, DMA_CH4) & DMA_CHXCTL_CHEN) != 0U) {
        /* a disable request can take a few cycles to complete */
    }
}

/*
 * *** 05/08/2026, REMOVED gd32_i2s_stream_reconfigure()/
 * gd32_i2s_stream_start() - superseded by gd32_i2s_stream_arm() above
 * ***, part of the "full reinit instead of live resync" rewrite. The
 * old split (reconfigure the frame count, then separately resync
 * I2S1_ADD via disable/re-enable and re-arm DMA) existed because a
 * live switch used to leave I2S1_ADD's existing configuration in
 * place and just nudge it - gd32_i2s_init_slave(rate) now does a FULL
 * teardown/rebuild of I2S1_ADD on every switch (see its own comment),
 * so there's nothing left for a separate resync step to do; a single
 * gd32_i2s_stream_arm(frames_per_half) call right after covers both
 * what reconfigure() and start() used to do together.
 */

/* Diagnostic-only: logs the first several gd32_i2s_stream_write_half()
 * calls after each gd32_i2s_stream_start() (stream_arm_dma() resets
 * this to 0) - added 05/08/2026 to chase the "first mode switch after
 * boot is silent, but the switch after that works" report. Original
 * theory: if dma_transfer_number_get() returns something unexpected
 * right after a fresh arm, the playing_half/write_half math below
 * could pick the WRONG half for the first few calls, writing into
 * audio that's actively being played instead of the free half.
 *
 * *** RULED OUT by real hardware logs *** - the project owner
 * captured one failing AM->WFM switch and one working AM->WFM switch
 * (same session, second attempt) and the DMA_CH4 remaining/pos/
 * playing_half/write_half sequence for the first 6 calls was
 * IDENTICAL between them. Whatever's failing on the first switch, it
 * isn't this half-selection logic - see aic3204_set_rate_power_up()'s
 * comment for the theory being tried next (codec PLL settling time).
 * Left in place since it's cheap and still useful for spotting a
 * genuine half-selection bug if one shows up later, just no longer
 * the leading suspect for this particular report. */
void gd32_i2s_stream_write_half(const int16_t *stereo_frames)
{
    /*
     * *** 05/08/2026, ALL per-call debug_print* output removed from
     * this function *** - it did its job (both the original 6-call
     * startup dump and the later same-half/heartbeat additions helped
     * track down and confirm the I2S frame-sync bug fixed in
     * main.c's apply_demod_mode()) but real hardware logs then showed
     * something important: the diagnostic prints themselves were
     * causing the NEXT symptom being chased. Once rx_lock's retry
     * fix guaranteed a clean raw I/Q capture, the project owner still
     * heard WFM audio as "muy distorsionado/entrecortado" - and the
     * log showed "SAME HALF WRITTEN TWICE" firing in tight clusters
     * immediately after every logged/heartbeat block, far too
     * regularly (every exact multiple of the heartbeat interval) to
     * be a real, independent glitch. debug_print()/debug_print_dec()
     * go out over a slow, blocking UART - stacking several of them
     * back-to-back inside this function, which runs synchronously in
     * the audio ISR chain every 2.67ms, can itself eat enough of that
     * budget to desync the very ping-pong buffer position being
     * reported, especially for WFM's much chattier per-block logging
     * elsewhere in this same call chain (demod_wfm_process_raw()'s
     * own checkpoints). In short: the instrumentation was measuring
     * its own footprint, not a real audio-path bug. Removed entirely
     * now that the diagnostics have already served their purpose -
     * see git history (or the transcript) if this class of bug ever
     * needs revisiting; re-add sparingly and expect to interpret
     * results with this caveat in mind.
     */
    uint32_t remaining = dma_transfer_number_get(DMA0, DMA_CH4);
    uint32_t pos = s_stream_total_words - remaining;
    uint32_t playing_half = (pos < s_stream_words_per_half) ? 0U : 1U;
    uint32_t write_half = 1U - playing_half;
    int16_t *dst = &s_stream_buf[write_half * s_stream_words_per_half];
    uint32_t w;

    /*
     * *** 05/08/2026, added for WFM FERR frequency diagnostics *** -
     * same reasoning as sdr_rx.c's DMA0_Channel3_IRQHandler() counter:
     * this function already runs every TX block, so it's the cheapest
     * place to count REAL FERR occurrences instead of just sampling
     * "was it set" once every ~1.5s from main.c. No debug_print here -
     * this specific function has its own hard-won lesson about UART
     * cost inside the audio ISR chain (see the big comment above).
     */
    {
        /*
         * *** 05/08/2026, FIXED alongside sdr_rx.c's identical fix ***
         * - removed the `discard = SPI_DATA(I2S1_ADD)` read that used
         * to be here. DMA0/CH4 is actively driving I2S1_ADD's transmit
         * FIFO from SPI_DATA while this function runs every block - a
         * manual CPU read/write of that register here can race the
         * DMA controller. See sdr_rx.c's DMA0_Channel3_IRQHandler()
         * comment for the full story (a severe real-hardware
         * regression - full-scale-saturated raw I/Q, near-constant
         * FERR - traced to this exact pattern on the RX side).
         */
        uint32_t stat = SPI_STAT(I2S1_ADD);
        if ((stat & SPI_STAT_FERR) != 0U) {
            s_tx_ferr_count++;
        }
    }

    for (w = 0; w < s_stream_words_per_half; w++) {
        dst[w] = stereo_frames[w];
    }
}

uint32_t gd32_i2s_get_tx_ferr_count(void)
{
    return s_tx_ferr_count;
}

void gd32_i2s_reset_tx_ferr_count(void)
{
    s_tx_ferr_count = 0U;
}

void gd32_i2s_dma_start_test_tone(void)
{
    dma_single_data_parameter_struct dma_init_struct;

    tone_buf_fill_1khz();

    rcu_periph_clock_enable(RCU_DMA0);

    debug_print_hex32("gd32_i2s: SPI_STAT(I2S1_ADD) right before arming DMA "
                       "(bit1=TBE should be 1 if ready to write)",
                       SPI_STAT(I2S1_ADD));

    /* DMA0, Channel 4, PERIEN=010 (SUBPERI2) for I2S1_ADD_TX - now the
     * TX side after the block-role swap - confirmed against the
     * GD32F4xx User Manual's DMA request mapping table (Table 10-2,
     * "Peripheral requests to DMA0"). */
    dma_deinit(DMA0, DMA_CH4);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.periph_addr         = (uint32_t)&SPI_DATA(I2S1_ADD);
    dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory0_addr        = (uint32_t)s_tone_buf;
    dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
    dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_ENABLE;
    dma_init_struct.direction           = DMA_MEMORY_TO_PERIPH;
    dma_init_struct.number              = TONE_SAMPLES_PER_CYCLE * 2U;
    /* *** 05/08/2026 fix *** - was DMA_PRIORITY_HIGH, see
     * gd32_i2s_dma_start_silence()'s comment for why this now matches
     * RX's ULTRA_HIGH. */
    dma_init_struct.priority            = DMA_PRIORITY_ULTRA_HIGH;
    dma_single_data_mode_init(DMA0, DMA_CH4, &dma_init_struct);

