nicohs67/deepsdr-101-open-firmware/User/gd32_i2s.c
    dma_channel_subperipheral_select(DMA0, DMA_CH4, DMA_SUBPERI2);

    dma_circulation_enable(DMA0, DMA_CH4);
    dma_channel_enable(DMA0, DMA_CH4);

    /* Enable the DMA transmit request on I2S1_ADD itself - without
     * this, the DMA channel is armed but the peripheral never
     * triggers it. */
    spi_dma_enable(I2S1_ADD, SPI_DMA_TRANSMIT);

    debug_print("gd32_i2s: circular DMA armed, 1kHz test tone should now be continuous "
                "(no longer stopping) on PB14, and audible on the AIC3204 output if "
                "phase 1 (I2C) left the codec unmuted\n");

    /*
     * Bring-up diagnostic: reads the DMA channel's remaining transfer
     * count twice, separated by a delay. If it doesn't change, the
     * channel is armed but inert (wrong DMA channel/subperipheral, or
     * DMATEN did not actually take); if it decrements, the channel is
     * firing and any remaining issue is elsewhere in the chain. Also
     * checks the DMATEN readback and the channel's error flags
     * (FEE/SDE/TAE), which would indicate an invalid
     * channel/subperipheral selection some other way.
     */
    {
        uint32_t cnt_a, cnt_b;
        volatile uint32_t d;

        debug_print_hex32("gd32_i2s: SPI_CTL1(I2S1_ADD) after spi_dma_enable (bit1=DMATEN should be 1)",
                           SPI_CTL1(I2S1_ADD));
        debug_print_hex32("gd32_i2s: DMA_CHCTL(DMA0,CH4) raw (bit0=CHEN should be 1)",
                           DMA_CHCTL(DMA0, DMA_CH4));

        cnt_a = dma_transfer_number_get(DMA0, DMA_CH4);
        for (d = 0; d < 2000000U; d++) { __NOP(); }
        cnt_b = dma_transfer_number_get(DMA0, DMA_CH4);

        debug_print_dec("gd32_i2s: DMA_CHCNT remaining, reading A", cnt_a);
        debug_print_dec("gd32_i2s: DMA_CHCNT remaining, reading B (after delay)", cnt_b);
        if (cnt_a == cnt_b) {
            debug_print("gd32_i2s: *** DMA_CHCNT NOT MOVING - channel is armed but INERT, "
                        "never triggers a request (check the DMA channel/subperipheral "
                        "selection against the request mapping table) ***\n");
        } else {
            debug_print("gd32_i2s: DMA_CHCNT IS decrementing - the channel is firing "
                        "requests, look elsewhere in the chain\n");
        }

        if (dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_FEE) == SET) {
            debug_print("gd32_i2s: *** DMA flag FEE (FIFO error/exception) set ***\n");
        }
        if (dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_SDE) == SET) {
            debug_print("gd32_i2s: *** DMA flag SDE (single data mode exception) set ***\n");
        }
        if (dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_TAE) == SET) {
            debug_print("gd32_i2s: *** DMA flag TAE (transfer access error) set - channel/"
                        "subperipheral is very likely misconfigured ***\n");
        }
        if (dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_HTF) == SET) {
            debug_print("gd32_i2s: DMA flag HTF (half transfer) set - "
                        "the channel HAS transferred at least half the buffer\n");
        }
        if (dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_FTF) == SET) {
            debug_print("gd32_i2s: DMA flag FTF (full transfer) set - "
                        "the channel HAS completed at least one circular round\n");
        }
        if (dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_HTF) == RESET &&
            dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_FTF) == RESET &&
            cnt_a == cnt_b) {
            debug_print("gd32_i2s: neither HTF nor FTF ever set - the channel has not "
                        "executed a single transfer since it was armed\n");
        }
    }
}
